---
kind: method
id: M:Autodesk.Revit.DB.Architecture.PostPattern.Dispose
source: html/825b4bec-d043-aba5-3cb2-3bbf2716679e.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern.Dispose Method

Releases all resources used by the PostPattern

## Syntax (C#)
```csharp
public void Dispose()
```